Repository: vaprub/S.T.A.L.K.E.R.2-Mod-Builder
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Welcome to S.T.A.L.K.E.R. 2 Mod Builder!
ru: Добро пожаловать в S.T.A.L.K.E.R. 2 Mod Builder!

source: S.T.A.L.K.E.R. 2 Ultimate Modpack Builder by Saymonn
ru: S.T.A.L.K.E.R. 2 Ultimate Modpack Builder от Saymonn

source: Extract Game Files
ru: Распаковать файлы игры

source: Create New Modpack
ru: Создать новый модпак

source: Settings
ru: Настройки

source: Check Game Version
ru: Проверить версию игры

source: Exit
ru: Выход

source: Invalid choice
ru: Неверный выбор

source: 🌐 Language Information:
ru: 🌐 Информация о языке:

source: Current language: {} ({})
ru: Текущий язык: {} ({})

source: Module Selection
ru: Выбор модулей

source: Game Version Analysis
ru: Анализ версии игры

source: Press Enter to continue...
ru: Нажмите Enter для продолжения...

source: 🚀 Initializing application...
ru: 🚀 Запуск приложения...

source: ✅ Application ready!
ru: ✅ Приложение готово!

source: Press Enter to continue to main menu...
ru: Нажмите Enter для перехода в главное меню...

source: ✅ Application finished successfully!
ru: ✅ Приложение успешно завершено!

source: Press Enter to exit...
ru: Нажмите Enter для выхода...

source: ⚠ Application terminated by user.
ru: ⚠ Приложение завершено пользователем.

source: ❌ Fatal error: {}
ru: ❌ Критическая ошибка: {}

source: Extract pakchunk0-Windows.pak? This may take a while (5-15 minutes), depending on the speed of your CPU. ~300,000 files / ~7GB data to extract). Continue?
ru: Распаковать pakchunk0-Windows.pak? Это может занять некоторое время (5-15 минут), в зависимости от скорости вашего процессора. Распаковывается ~300,000 файлов / ~7 ГБ данных). Продолжить?

source: Extraction completed successfully!
ru: Распаковка успешно завершена!

source: Extraction failed!
ru: Ошибка распаковки!

source: Select which modules to include in your modpack:
ru: Выберите модули для включения в ваш модпак:

source: Include {}?
ru: Включить {}?

source: No modules selected. Returning to main menu...
ru: Модули не выбраны. Возврат в главное меню...

source: Failed to configure {}
ru: Не удалось настроить {}

source: Enter modpack name (or press Enter for default):
ru: Введите имя модпака (или нажмите Enter для имени по умолчанию):

source: Building modpack with {} module(s)...
ru: Сборка модпака с {} модулями...

source: Returning to main menu...
ru: Возврат в главное меню...

source: Modpack creation failed!
ru: Ошибка создания модпака!

source: No valid configurations. Modpack creation cancelled.
ru: Нет допустимых конфигураций. Создание модпака отменено.

source: Custom Configuration
ru: Пользовательская настройка

source: Select configuration for {}
ru: Выберите конфигурацию для {}

source: Configuring: {}
ru: Настройка: {}

source: GAME VERSION ANALYSIS
ru: АНАЛИЗ ВЕРСИИ ИГРЫ

source: Detected version: {}
ru: Обнаруженная версия: {}

source: File format: {}
ru: Формат файлов: {}

source: binary
ru: бинарный

source: text
ru: текстовый

source: mixed
ru: смешанный

source: mixed/unknown
ru: смешанный/неизвестный

source: unknown
ru: неизвестно

source: modern
ru: современная

source: ✓ Using modern configuration (binary files detected)
ru: ✓ Используется современная конфигурация (обнаружены бинарные файлы)

source: ⚠ Using legacy configuration (text files detected)
ru: ⚠ Используется устаревшая конфигурация (обнаружены текстовые файлы)

source: GAME VERSION DETECTION
ru: ОПРЕДЕЛЕНИЕ ВЕРСИИ ИГРЫ

source: 📊 Detected version: {}
ru: 📊 Обнаруженная версия: {}

source: 📁 File format: {}
ru: 📁 Формат файлов: {}

source: 🔧 Modern format: {}
ru: 🔧 Современный формат: {}

source: ✅ Yes
ru: ✅ Да

source: ❌ No
ru: ❌ Нет

source: ⚠ Warnings:
ru: ⚠ Предупреждения:

source: How to interpret this:
ru: Как это понимать:

source: • 1.8.1+ = Modern version with binary files
ru: • 1.8.1+ = Современная версия с бинарными файлами

source: • 1.5.2-1.7.x = Older version with text files
ru: • 1.5.2-1.7.x = Старая версия с текстовыми файлами

source: • mixed = Inconsistent file formats (may cause issues)
ru: • mixed = Несогласованные форматы файлов (могут быть проблемы)

source: LANGUAGE SELECTION
ru: ВЫБОР ЯЗЫКА

source: Select your language
ru: Выберите язык

source: Language changed to {}
ru: Язык изменен на {}

source: Failed to change language
ru: Не удалось изменить язык

source: Language Settings
ru: Настройки языка

source: Change Game Path
ru: Изменить путь к игре

source: View Current Settings
ru: Просмотреть текущие настройки

source: Clear Cache
ru: Очистить кэш

source: Refresh Extraction Status
ru: Обновить статус распаковки

source: Back
ru: Назад

source: Completed
ru: Завершено

source: Not completed
ru: Не завершено

source: Extraction status refreshed
ru: Статус распаковки обновлен

source: Current Settings
ru: Текущие настройки

source: Game Path: {}
ru: Путь к игре: {}

source: Not set
ru: Не указан

source: Modpack Base Path: {}
ru: Базовый путь модпака: {}

source: Last Extraction: {}
ru: Последняя распаковка: {}

source: Never
ru: Никогда

source: Extraction Status: {}
ru: Статус распаковки: {}

source: Language: {} ({})
ru: Язык: {} ({})

source: Active Extraction Folder: {}
ru: Активная папка распаковки: {}

source: Game Version: {}
ru: Версия игры: {}

source: Clear all cached data?
ru: Очистить все кэшированные данные?

source: Cache cleared!
ru: Кэш очищен!

source: Please enter 'y' or 'n'
ru: Пожалуйста, введите 'y' или 'n'

source: Invalid input. Please try again.
ru: Неверный ввод. Пожалуйста, попробуйте снова.

source: GAME PATH SETUP REQUIRED
ru: ТРЕБУЕТСЯ НАСТРОЙКА ПУТИ К ИГРЕ

source: The application needs to locate your S.T.A.L.K.E.R. 2 installation. You need to find and select this file: • Stalker2-Win64-Shipping.exe (located in Stalker2/Binaries/Win64/) Common locations: • Steam: C:\Program Files (x86)\Steam\steamapps\common\S.T.A.L.K.E.R. 2 Heart of Chornobyl\ • Epic: C:\Program Files\Epic Games\S.T.A.L.K.E.R. 2 Heart of Chornobyl\ • GOG: C:\GOG Games\S.T.A.L.K.E.R. 2 Heart of Chornobyl\
ru: Приложению необходимо найти вашу установку S.T.A.L.K.E.R. 2. Вам нужно найти и выбрать этот файл: • Stalker2-Win64-Shipping.exe (находится в папке Stalker2/Binaries/Win64/) Обычные расположения: • Steam: C:\Program Files (x86)\Steam\steamapps\common\S.T.A.L.K.E.R. 2 Heart of Chornobyl\ • Epic: C:\Program Files\Epic Games\S.T.A.L.K.E.R. 2 Heart of Chornobyl\ • GOG: C:\GOG Games\S.T.A.L.K.E.R. 2 Heart of Chornobyl\

source: Press Enter to open file browser...
ru: Нажмите Enter для открытия проводника...

source: Select STALKER 2 Executable (Stalker2-Win64-Shipping.exe)
ru: Выберите исполняемый файл STALKER 2 (Stalker2-Win64-Shipping.exe)

source: Game path set successfully!
ru: Путь к игре успешно установлен!

source: Game directory: {}
ru: Папка игры: {}

source: ⚠ Warning: Could not validate game installation.
ru: ⚠ Предупреждение: Не удалось проверить установку игры.

source: Make sure you selected the correct executable.
ru: Убедитесь, что вы выбрали правильный исполняемый файл.

source: ✓ Game installation validated successfully!
ru: ✓ Установка игры успешно проверена!

source: ✗ No file selected. Game path setup cancelled.
ru: ✗ Файл не выбран. Настройка пути к игре отменена.

source: You can set the game path later in Settings.
ru: Вы можете установить путь к игре позже в настройках.

source: ERROR: Game files must be extracted first!
ru: ОШИБКА: Сначала необходимо распаковать файлы игры!

source: Using extraction folder: {}
ru: Используется папка распаковки: {}

source: ⚠ File conflicts detected:
ru: ⚠ Обнаружены конфликты файлов:

source: {} will be modified by: {}
ru: {} будет изменен модулями: {}

source: Modules will apply changes incrementally (later modules preserve earlier changes)
ru: Модули будут применять изменения последовательно (более поздние модули сохраняют изменения предыдущих)

source: Applying module: {}
ru: Применение модуля: {}

source: ✓ {} applied successfully
ru: ✓ {} успешно применен

source: ✗ Failed to apply {}
ru: ✗ Не удалось применить {}

source: ✗ Module not found: {}
ru: ✗ Модуль не найден: {}

source: Available modules: {}
ru: Доступные модули: {}

source: ERROR: No modules were applied successfully
ru: ОШИБКА: Ни один модуль не был успешно применен

source: Packing mod to: {}
ru: Упаковка мода в: {}

source: Please wait...
ru: Пожалуйста, подождите...

source: ✓ Mod packed successfully!
ru: ✓ Мод успешно упакован!

source: 📦 Creating Vortex-compatible ZIP archive...
ru: 📦 Создание ZIP-архива для Vortex...

source: 📦 Added to ZIP: {}
ru: 📦 Добавлено в ZIP: {}

source: ✅ Vortex ZIP created: {} ({:.2f} MB)
ru: ✅ ZIP для Vortex создан: {} ({:.2f} МБ)

source: Location: {}
ru: Расположение: {}

source: ⚠️ Warning: Could not create Vortex ZIP: {}
ru: ⚠️ Предупреждение: Не удалось создать ZIP для Vortex: {}

source: ✓ Unpacked version created in: {}
ru: ✓ Распакованная версия создана в: {}

source: CUSTOM MOD CREATED SUCCESSFULLY!
ru: ПОЛЬЗОВАТЕЛЬСКИЙ МОД УСПЕШНО СОЗДАН!

source: 📦 Packed mod (.pak): {}
ru: 📦 Упакованный мод (.pak): {}

source: 📂 Unpacked mod (folders): {}
ru: 📂 Распакованный мод (папки): {}

source: 🎮 Vortex ZIP: {}
ru: 🎮 ZIP для Vortex: {}

source: ⚠ NOTE: You are using an older game version (pre-1.8.1)
ru: ⚠ ПРИМЕЧАНИЕ: Вы используете старую версию игры (до 1.8.1)

source: The mod should work, but some features may be different.
ru: Мод должен работать, но некоторые функции могут отличаться.
